{
  "_attn_implementation_autoset": true,
  "_name_or_path": "Intel/polite-guard",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "polite",
    "1": "somewhat polite",
    "2": "neutral",
    "3": "impolite"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "impolite": 3,
    "neutral": 2,
    "polite": 0,
    "somewhat polite": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.46.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
